Switch>enable
Switch#config t
Enter configuration commands, one per line.  End with CNTL/Z.

! changing hostname
Switch(config)#hostname Sw01
Sw01(config)#line console 0

! securing user EXEC mode access
Sw01(config-line)#password cisco

! enabling user EXEC access
Sw01(config-line)#login
Sw01(config-line)#exit

! securing privileged EXEC mode
Sw01(config)#enable secret class
Sw01(config)#line vty 0 15

! securing virtual terminal
Sw01(config-line)#password cisco

! enabling password
Sw01(config-line)#login
Sw01(config-line)#exit

! adding a banner
Sw01(config)#banner motd #Authorized personnel only#

! encrypting every password that are plaintext
Sw01(config)#service password-encryption 
Sw01(config)#end
Sw01#
%SYS-5-CONFIG_I: Configured from console by console

Sw01#show running-config 
Building configuration...

Current configuration : 1246 bytes
!
version 15.0
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
!
hostname Sw01
!
enable secret 5 $1$mERr$9cTjUIEqNGurQiFU.ZeCi1
!
!
!
!
!
!
spanning-tree mode pvst
spanning-tree extend system-id
!
interface FastEthernet0/1
!
interface FastEthernet0/2
!
interface FastEthernet0/3
!
interface FastEthernet0/4
!
interface FastEthernet0/5
!
interface FastEthernet0/6
!
interface FastEthernet0/7
!
interface FastEthernet0/8
!
interface FastEthernet0/9
!
interface FastEthernet0/10
!
interface FastEthernet0/11
!
interface FastEthernet0/12
!
interface FastEthernet0/13
!
interface FastEthernet0/14
!
interface FastEthernet0/15
!
interface FastEthernet0/16
!
interface FastEthernet0/17
!
interface FastEthernet0/18
!
interface FastEthernet0/19
!
interface FastEthernet0/20
!
interface FastEthernet0/21
!
interface FastEthernet0/22
!
interface FastEthernet0/23
!
interface FastEthernet0/24
!
interface GigabitEthernet0/1
!
interface GigabitEthernet0/2
!
interface Vlan1
 no ip address
 shutdown
!
banner motd ^CAuthorized personnel only^C
!
!
!
line con 0
 password 7 0822455D0A16
 login
!
line vty 0 4
 password 7 0822455D0A16
 login
line vty 5 15
 password 7 0822455D0A16
 login
!
!
!
!
end

